:PROPERTIES:
:ID:       3A6CCE42-1D89-46CC-8AC4-8358CE2A751C
:END:
#+TITLE: Laravel LazyCollection in depth
#+AUTHOR: takeokunn
#+DESCRIPTION: description
#+DATE: 2025-02-04T17:52:58+0900
#+HUGO_BASE_DIR: ../../
#+HUGO_CATEGORIES: fleeting
#+HUGO_SECTION: posts/fleeting
#+HUGO_TAGS: fleeting laravel php
#+HUGO_DRAFT: false
#+STARTUP: content
#+STARTUP: fold
*** 遅延評価関数とそれ以外の違い

=return new static= のものは遅延評価、それ以外のものは即時評価対象。
=sum= や =avg= などすべてを評価したうえで実行しないと結果が得られないものも即時評価対象。

#+begin_src php
  // 遅延評価
  public static function make($items = [])
  {
      return new static($items);
  }

  // 即時評価
  public function all()
  {
      if (is_array($this->source)) {
          return $this->source;
      }

      return iterator_to_array($this->getIterator());
  }

#+end_src

#+RESULTS:
:results:
:end:
